Revit 2027 API
OverrideGraphicSettings.SetCutBackgroundPatternColor Method
 Sets the override color of the background pattern of cut faces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetCutBackgroundPatternColor(
	Color color
)
Public Function SetCutBackgroundPatternColor (
	color As Color
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetCutBackgroundPatternColor(
	Color^ color
)
member SetCutBackgroundPatternColor :
        color : Color -> OverrideGraphicSettings
Parameters
color Color
 Value of the cut face background color for the override. InvalidColorValue means no override is set.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace